w=int(input("น้ำหนักตัว : "))
h=int(input("ส่วนสูง : "))
BMI= w/((h/100)**2)
print("BMI = %.2f" % BMI)

if BMI < 18.50:
     print("อยู่ในเกณฑ์ : น้ำหนักน้อย/ผอม  ภาวะเสี่ยงต่อโรค : มากกว่าคนปกติ")
elif BMI >= 18.50 and BMI <= 22.90:
     print("อยู่ในเกณฑ์ : ปกติ(สุขภาพดี)  ภาวะเสี่ยงต่อโรค : เท่ากับคนปกติ")
elif BMI >= 23 and BMI <= 24.90:
     print("อยู่ในเกณฑ์ : ท้วม(โรคอ้วนระดับนึง)  ภาวะเสี่ยงต่อโรค : อันตรายระดับ1")
elif BMI >= 25 and BMI <= 29.90:
     print("อยู่ในเกณฑ์ : อ้วน(โรคอ้วนระดับ2)  ภาวะเสี่ยงต่อโรค : อันตรายระดับ2")
else:
     print("อยู่ในเกณฑ์ : อ้วนมาก(โรคอ้วนอ้วนระดับ3)  ภาวะเสี่ยงต่อโรค : อันตรายระดับ3")     
     